sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
/**
 ******************************************************************************
 * @file    ethernetif.c
 * @brief   STM32H5 LwIP Ethernet Interface with HAL callback model
 * @note    Clean implementation with proper buffer tracking to prevent RBU
 * errors. Each buffer can only be assigned to ONE descriptor at a time.
 ******************************************************************************
 */

/* Enable debug logging - set to 1 to enable, 0 to disable */
#define ETH_DEBUG_ENABLE 0

#if ETH_DEBUG_ENABLE
#include <stdio.h>
#define ETH_DEBUG(fmt, ...) \
    LOG_INF("[ETH %lu] " fmt "\r\n", HAL_GetTick(), ##__VA_ARGS__)
#else
#define ETH_DEBUG(fmt, ...) ((void)0)
#endif

#include <string.h>

#include "FreeRTOS.h"
#include "bsp.h"
#include "ethernetif.h"
#include "ip_specs.h"
#include "lan8742.h"
#include "lwip/apps/mdns.h"
#include "lwip/apps/sntp.h"
#include "lwip/etharp.h"
#include "lwip/mem.h"
#include "lwip/memp.h"
#include "lwip/netif.h"
#include "lwip/opt.h"
#include "lwip/pbuf.h"
#include "lwip/stats.h"
#include "lwip/tcpip.h"
#include "lwip/timeouts.h"
#include "main.h"
#include "netif/ethernet.h"
#include "network_sync.h"
#include "semphr.h"
#include "stm32h5xx_hal.h"
#include "task.h"

/* mDNS service for Modbus */

static void ethernetif_status_callback(struct netif *netif)
{
    static bool services_initialized = false;

    /* Guard: only handle our netif, once, when IP is valid */
    if (netif_is_up(netif) && !ip4_addr_isany(netif_ip4_addr(netif)) &&
        !services_initialized)
    {
        ip_addr_t sntp_server_ip;
        char      hostname[32];
        char      ip_str[16];
        char      gw_str[16];
        char      nm_str[16];
        uint8_t   dev_addr;

        /* --- System state update --- */
        dev_addr = BSP_GetDeviceAddress();
        snprintf(hostname, sizeof(hostname), "jerry-dev-%u",
                 (unsigned int)dev_addr);

        NetworkSync_SignalDhcpReady();

        /* --- Log network configuration --- */
        ip4addr_ntoa_r(netif_ip4_addr(netif), ip_str, sizeof(ip_str));
        ip4addr_ntoa_r(netif_ip4_gw(netif), gw_str, sizeof(gw_str));
        ip4addr_ntoa_r(netif_ip4_netmask(netif), nm_str, sizeof(nm_str));

        printf("=== DHCP Complete ===\r\n");
        printf("IP Address : %s\r\n", ip_str);
        printf("Netmask    : %s\r\n", nm_str);
        printf("Gateway    : %s\r\n", gw_str);
        printf("Flags      : 0x%02x\r\n", netif->flags);
        printf("netif_default: %p, our netif: %p\r\n", (void *)netif_default,
               (void *)netif);
        printf("=====================\r\n");

        /* --- Initialize SNTP --- */
        printf("Initializing SNTP...\r\n");
        IP_ADDR4(&sntp_server_ip, SNTP_IP_ADDR0, SNTP_IP_ADDR1, SNTP_IP_ADDR2,
                 SNTP_IP_ADDR3);
        sntp_setserver(0, &sntp_server_ip);
        sntp_setoperatingmode(SNTP_OPMODE_POLL);
        sntp_init();

        mdns_resp_init();

        err_t err = mdns_resp_add_netif(netif, hostname, 255);
        if (err != ERR_OK)
        {
            printf("mDNS: add_netif failed: %d\r\n", (int)err);
            return;
        }
        printf("mDNS: netif registered: '%s'\r\n", hostname);

        int8_t slot = mdns_resp_add_service(
            netif, hostname, "_modbus", DNSSD_PROTO_TCP, 502, 4500, NULL, NULL);
        if (slot >= 0)
        {
            printf("mDNS: service registered (slot: %d)\r\n", slot);
            // mdns_resp_announce(netif);
        }
        else
        {
            printf("mDNS: add_service failed: %d\r\n", (int)slot);
        }

        services_initialized = true;
        HAL_IWDG_Refresh(&hiwdg);
    }
    else if (!netif_is_up(netif))
    {
        ETH_DEBUG("Network going down, removing netif from mDNS");
        /* Remove the network interface from mDNS */
        mdns_resp_remove_netif(netif);
        /* Note: We do not deinitialize mDNS here because there is no
         * mdns_resp_deinit() */
        /* We leave the mDNS PCB allocated until the next reset. */
    }
}

#define ETHIF_TX_TIMEOUT            (2000U)
#define INTERFACE_THREAD_STACK_SIZE (1024)
#define IFNAME0                     's'
#define IFNAME1                     't'
#define ETH_RX_BUFFER_SIZE          (1536U)

/* MAC address is defined in ethernetif.h - single source of truth */

/* DMA Descriptors in SRAM3 (non-cacheable) - defined in main.c */
extern ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT];
extern ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT];

/* Use the ETH handle from main.c */
extern ETH_HandleTypeDef heth;

/* RX buffers in SRAM3 for cache coherency
 * IMPORTANT: We need MORE buffers than descriptors to handle the case where
 * some buffers are being processed by the application while DMA needs new ones.
 * Using 2x the descriptor count gives us headroom.
 */
#define RX_BUFFER_COUNT (ETH_RX_DESC_CNT * 2)
static uint8_t RxBuff[RX_BUFFER_COUNT][ETH_RX_BUFFER_SIZE]
    __attribute__((section(".driver.eth_mac0_rx_buf"), aligned(32)));

/* Buffer tracking:
 * - RxBuffAssigned: Bitmask tracking which buffers are currently assigned to
 * DMA descriptors
 * - A buffer is "assigned" from when RxAllocateCallback returns it until
 * RxLinkCallback processes it
 * - After RxLinkCallback, the HAL clears BackupAddr0, and the next
 * RxAllocateCallback can reuse it
 */
static volatile uint32_t RxBuffAssigned =
    0; /* Bitmask: bit N = buffer N assigned to DMA */
static volatile uint32_t CurrentRxBuffIdx = 0;

static SemaphoreHandle_t RxPktSemaphore = NULL;
static SemaphoreHandle_t TxPktSemaphore = NULL;
static TaskHandle_t      EthIfThread    = NULL;

/* Static semaphore buffers for FreeRTOS */
static StaticSemaphore_t RxSemaphoreBuffer;
static StaticSemaphore_t TxSemaphoreBuffer;

static lan8742_Object_t LAN8742;

/* Forward declarations */
static void    ethernetif_input_task(void *argument);
static int32_t ETH_PHY_IO_Init(void);
static int32_t ETH_PHY_IO_DeInit(void);
static int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr,
                                  uint32_t *pRegVal);
static int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr,
                                   uint32_t RegVal);
static int32_t ETH_PHY_IO_GetTick(void);

