sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
static lan8742_IOCtx_t LAN8742_IOCtx = {ETH_PHY_IO_Init, ETH_PHY_IO_DeInit,
                                        ETH_PHY_IO_WriteReg, ETH_PHY_IO_ReadReg,
                                        ETH_PHY_IO_GetTick};

static int32_t ETH_PHY_IO_Init(void)
{
    HAL_ETH_SetMDIOClockRange(&heth);
    return 0;
}
static int32_t ETH_PHY_IO_DeInit(void) { return 0; }
static int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr,
                                  uint32_t *pRegVal)
{
    return (HAL_ETH_ReadPHYRegister(&heth, DevAddr, RegAddr, pRegVal) == HAL_OK)
               ? 0
               : -1;
}
static int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr,
                                   uint32_t RegVal)
{
    return (HAL_ETH_WritePHYRegister(&heth, DevAddr, RegAddr, RegVal) == HAL_OK)
               ? 0
               : -1;
}
static int32_t ETH_PHY_IO_GetTick(void) { return (int32_t)HAL_GetTick(); }

/**
 * @brief  Find buffer index from buffer address
 * @param  buff: Buffer address to find
 * @retval Buffer index or -1 if not found
 */
static int32_t find_rx_buffer_index(uint8_t *buff)
{
    for (uint32_t i = 0; i < RX_BUFFER_COUNT; i++)
    {
        if (buff == &RxBuff[i][0])
        {
            return (int32_t)i;
        }
    }
    return -1;
}

/**
 * @brief  HAL ETH RX Allocate Callback - Allocates buffer for DMA descriptor
 * @param  buff: Pointer to receive buffer pointer
 * @note   This is the KEY function for preventing RBU errors!
 *         We track which buffers are assigned to DMA and only return free ones.
 *         A buffer is marked as "assigned" here and freed in RxLinkCallback.
 */
void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
    uint32_t startIdx = CurrentRxBuffIdx;

    /* Find a free buffer using round-robin search */
    for (uint32_t i = 0; i < RX_BUFFER_COUNT; i++)
    {
        uint32_t idx  = (startIdx + i) % RX_BUFFER_COUNT;
        uint32_t mask = (1U << idx);

        /* Check if buffer is free (not assigned to any descriptor) */
        if ((RxBuffAssigned & mask) == 0)
        {
            /* Mark buffer as assigned to DMA */
            RxBuffAssigned |= mask;
            CurrentRxBuffIdx = (idx + 1) % RX_BUFFER_COUNT;
            *buff            = &RxBuff[idx][0];
            return;
        }
    }

    /* No buffer available - this will cause RBU error! */
    ETH_DEBUG("RxAlloc FAILED! No free buffers", 0);
    *buff = NULL;
}

/**
 * @brief  HAL ETH RX Link Callback - Links received data to pbuf chain
 * @param  pStart: Pointer to start of pbuf chain
 * @param  pEnd: Pointer to end of pbuf chain
 * @param  buff: Pointer to received data buffer
 * @param  Length: Length of received data
 * @note   We copy data from DMA buffer to a new pbuf, then FREE the buffer
 *         so it can be reused by RxAllocateCallback.
 */
void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff,
                            uint16_t Length)
{
    struct pbuf **ppStart = (struct pbuf **)pStart;
    struct pbuf **ppEnd   = (struct pbuf **)pEnd;
    struct pbuf  *p;
    int32_t       bufIdx;

    /* Find buffer index and mark it as free */
    bufIdx = find_rx_buffer_index(buff);
    if (bufIdx >= 0)
    {
        /* Clear the assigned bit - buffer is now free for reuse */
        RxBuffAssigned &= ~(1U << bufIdx);
    }

    /* Allocate a pbuf for the received frame segment */
    p = pbuf_alloc(PBUF_RAW, Length, PBUF_POOL);

    if (p != NULL)
    {
        /* Data Synchronization Barrier before reading DMA buffer */
        __DSB();
        pbuf_take(p, buff, Length);

        /* Chain the pbuf */
        if (*ppStart == NULL)
        {
            *ppStart = p;
        }
        else if (*ppEnd != NULL)
        {
            pbuf_cat(*ppEnd, p);
        }
        *ppEnd = p;
    }
    else
    {
        ETH_DEBUG("pbuf_alloc FAILED!", 0);
    }
}

static void low_level_init(struct netif *netif)
{
    uint32_t             duplex, speed = 0U;
    int32_t              PHYLinkState;
    ETH_MACConfigTypeDef MACConf = {0};
    HAL_StatusTypeDef    hal_status;

    ETH_DEBUG("low_level_init: Starting", 0);

    /* Initialize buffer tracking - all buffers free */
    RxBuffAssigned   = 0;
    CurrentRxBuffIdx = 0;

    /* Get MAC address from Unique Device ID */
    ethernetif_get_mac_addr(netif->hwaddr);
    netif->hwaddr_len = ETH_HWADDR_LEN;
    netif->mtu        = ETH_MAX_PAYLOAD;
    netif->flags |= NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_IGMP;

    ETH_DEBUG("MAC: %02X:%02X:%02X:%02X:%02X:%02X", netif->hwaddr[0],
              netif->hwaddr[1], netif->hwaddr[2], netif->hwaddr[3],
              netif->hwaddr[4], netif->hwaddr[5]);

    /* Create semaphores */
    RxPktSemaphore = xSemaphoreCreateBinaryStatic(&RxSemaphoreBuffer);
    TxPktSemaphore = xSemaphoreCreateBinaryStatic(&TxSemaphoreBuffer);

    /* Create RX task */
    static StaticTask_t xTaskBuffer;
    static StackType_t  xStack[INTERFACE_THREAD_STACK_SIZE];
    EthIfThread = xTaskCreateStatic(
        ethernetif_input_task, "EthIf", INTERFACE_THREAD_STACK_SIZE, netif,
        configMAX_PRIORITIES - 1, xStack, &xTaskBuffer);

    /* Initialize PHY */
    LAN8742_RegisterBusIO(&LAN8742, &LAN8742_IOCtx);
    if (LAN8742_Init(&LAN8742) != LAN8742_STATUS_OK)
    {
        ETH_DEBUG("PHY init FAILED!", 0);
        netif_set_link_down(netif);
        netif_set_down(netif);
        return;
    }

    PHYLinkState = LAN8742_GetLinkState(&LAN8742);

    /* Don't start ETH if link is down - wait for link to come up */
    if (PHYLinkState <= LAN8742_STATUS_LINK_DOWN)
    {
        ETH_DEBUG("Link DOWN, deferring ETH start", 0);
        netif_set_up(netif);
        netif_set_link_down(netif);
        return;
    }

    /* Configure speed/duplex based on PHY state */
    switch (PHYLinkState)
    {
        case LAN8742_STATUS_100MBITS_FULLDUPLEX:
            duplex = ETH_FULLDUPLEX_MODE;
            speed  = ETH_SPEED_100M;
            break;
        case LAN8742_STATUS_100MBITS_HALFDUPLEX:
            duplex = ETH_HALFDUPLEX_MODE;
            speed  = ETH_SPEED_100M;
            break;
        case LAN8742_STATUS_10MBITS_FULLDUPLEX:
            duplex = ETH_FULLDUPLEX_MODE;
            speed  = ETH_SPEED_10M;
            break;
        case LAN8742_STATUS_10MBITS_HALFDUPLEX:
            duplex = ETH_HALFDUPLEX_MODE;
            speed  = ETH_SPEED_10M;
            break;
        default:
            duplex = ETH_FULLDUPLEX_MODE;
            speed  = ETH_SPEED_100M;
            break;
    }

    HAL_ETH_GetMACConfig(&heth, &MACConf);
    MACConf.DuplexMode = duplex;
    MACConf.Speed      = speed;
    HAL_ETH_SetMACConfig(&heth, &MACConf);

    /* Memory barriers before starting DMA */
    __DSB();
    __ISB();

    hal_status = HAL_ETH_Start_IT(&heth);

    if (hal_status == HAL_OK)
    {
        netif_set_up(netif);
        netif_set_link_up(netif);
        ETH_DEBUG("ETH started, Link UP", 0);
    }
    else
    {
        ETH_DEBUG("HAL_ETH_Start_IT FAILED!", 0);
        netif_set_down(netif);
        netif_set_link_down(netif);
    }
}

static err_t low_level_output(struct netif *netif, struct pbuf *p)
{
    (void)netif;
    uint32_t          i = 0U;
    struct pbuf      *q;
    ETH_BufferTypeDef Txbuffer[ETH_TX_DESC_CNT];
    HAL_StatusTypeDef tx_status;

    LINK_STATS_INC(link.xmit);

    uint8_t *data = (uint8_t *)p->payload;
    (void)data;
    ETH_DEBUG("TX: len=%u, dst=%02X:%02X:%02X:%02X:%02X:%02X, type=0x%02X%02X",
              (unsigned)p->tot_len, data[0], data[1], data[2], data[3], data[4],
              data[5], data[12], data[13]);

    memset(Txbuffer, 0, ETH_TX_DESC_CNT * sizeof(ETH_BufferTypeDef));
    for (q = p; q != NULL; q = q->next)
    {
        if (i >= ETH_TX_DESC_CNT) return ERR_IF;
        Txbuffer[i].buffer = q->payload;
        Txbuffer[i].len    = q->len;
        if (i > 0) Txbuffer[i - 1].next = &Txbuffer[i];
        if (q->next == NULL) Txbuffer[i].next = NULL;
        i++;
    }

    ETH_TxPacketConfigTypeDef localTxConfig = {0};
    localTxConfig.Attributes                = ETH_TX_PACKETS_FEATURES_CRCPAD;
    localTxConfig.ChecksumCtrl              = ETH_CHECKSUM_DISABLE;
    localTxConfig.CRCPadCtrl                = ETH_CRC_PAD_INSERT;
    localTxConfig.Length                    = p->tot_len;
    localTxConfig.TxBuffer                  = Txbuffer;
    localTxConfig.pData                     = p;

    pbuf_ref(p);

    __DSB();

