sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
    HAL_ETH_ReleaseTxPacket(&heth);
    heth.ErrorCode = HAL_ETH_ERROR_NONE;
    tx_status      = HAL_ETH_Transmit_IT(&heth, &localTxConfig);

    /* ✅ FIX 1: Bounded retry loop — max 3 attempts */
    uint32_t retries = 0U;
    while (tx_status != HAL_OK)
    {
        if ((HAL_ETH_GetError(&heth) & HAL_ETH_ERROR_BUSY) &&
            (retries < 3U))  // ← exit condition
        {
            retries++;
            if (xSemaphoreTake(TxPktSemaphore,
                               pdMS_TO_TICKS(ETHIF_TX_TIMEOUT)) != pdTRUE)
            {
                ETH_DEBUG("TX semaphore timeout (retry %lu)", retries);
            }
            HAL_ETH_ReleaseTxPacket(&heth);
            heth.ErrorCode = HAL_ETH_ERROR_NONE;
            tx_status      = HAL_ETH_Transmit_IT(&heth, &localTxConfig);
        }
        else
        {
            ETH_DEBUG("TX FAILED after %lu retries!", retries);
            pbuf_free(p);  // ← undo pbuf_ref() on failure
            return ERR_IF;
        }
    }

    /* Note: pbuf freed later via HAL_ETH_TxFreeCallback → pbuf_free(p) */
    return ERR_OK;
}

static struct pbuf *low_level_input(struct netif *netif)
{
    (void)netif;
    struct pbuf *p = NULL;

    if (HAL_ETH_ReadData(&heth, (void **)&p) == HAL_OK && p != NULL)
    {
        __DSB();
        /* Update link statistics */
        LINK_STATS_INC(link.recv);

        /* Log packet details including first bytes for protocol identification
         */
        uint8_t *data = (uint8_t *)p->payload;
        (void)data;
        ETH_DEBUG(
            "RX: len=%u, dst=%02X:%02X:%02X:%02X:%02X:%02X, type=0x%02X%02X",
            (unsigned)p->tot_len, data[0], data[1], data[2], data[3], data[4],
            data[5], data[12], data[13]);
    }
    return p;
}

void ethernetif_input(struct netif *netif)
{
    struct pbuf *p;
    p = low_level_input(netif);
    if (p != NULL)
    {
        err_t err = netif->input(p, netif);
        if (err != ERR_OK)
        {
            ETH_DEBUG("netif->input FAILED: err=%d", (int)err);
            pbuf_free(p);
        }
    }
}

/* Counter for RX interrupts - for debugging */
static volatile uint32_t RxIntCount = 0;

/* Debug counters for semaphore takes and packets processed */
static volatile uint32_t SemTakeCount      = 0;
static volatile uint32_t PktProcessedCount = 0;

static void ethernetif_input_task(void *argument)
{
    struct pbuf  *p;
    struct netif *netif = (struct netif *)argument;

    for (;;)
    {
        if (xSemaphoreTake(RxPktSemaphore, pdMS_TO_TICKS(5000)) == pdTRUE)
        {
            SemTakeCount++;
            do
            {
                p = low_level_input(netif);
                if (p != NULL)
                {
                    PktProcessedCount++;
                    if (netif->input(p, netif) != ERR_OK)
                    {
                        ETH_DEBUG("netif->input FAILED!", 0);
                        pbuf_free(p);
                    }
                }
            } while (p != NULL);
        }
    }
}

err_t ethernetif_init(struct netif *netif)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
#if LWIP_NETIF_HOSTNAME
    netif->hostname = "lwip";
#endif
    netif->name[0]    = IFNAME0;
    netif->name[1]    = IFNAME1;
    netif->output     = etharp_output;
    netif->linkoutput = low_level_output;
    netif_set_status_callback(netif, ethernetif_status_callback);
    low_level_init(netif);
    return ERR_OK;
}

void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth_param)
{
    (void)heth_param;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    RxIntCount++;
    if (RxPktSemaphore)
    {
        xSemaphoreGiveFromISR(RxPktSemaphore, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

/* Debug function to get semaphore take count */
uint32_t ethernetif_get_sem_take_count(void) { return SemTakeCount; }

/* Debug function to get processed packet count */
uint32_t ethernetif_get_pkt_processed_count(void) { return PktProcessedCount; }

uint32_t ethernetif_get_rx_int_count(void) { return RxIntCount; }

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth_param)
{
    (void)heth_param;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;

    /* We MUST NOT call HAL_ETH_ReleaseTxPacket here because it calls
     * pbuf_free() via HAL_ETH_TxFreeCallback. FreeRTOS mutexes (used by LwIP
     * memory manager) cannot be taken in an ISR! We simply signal the
     * TxPktSemaphore. */
    if (TxPktSemaphore)
    {
        xSemaphoreGiveFromISR(TxPktSemaphore, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

/**
 * @brief  HAL ETH TX Free Callback - Frees pbuf after transmission completes
 * @param  buff: Pointer to the packet data (actually a pbuf pointer cast to
 * uint32_t*)
 * @note   This callback is invoked by HAL_ETH_ReleaseTxPacket() for each
 *         transmitted packet. The buff parameter is the pData field from
 *         ETH_TxPacketConfigTypeDef, which we set to the pbuf pointer.
 *
 *         Without this callback, transmitted pbufs are never freed, causing
 *         heap exhaustion during sustained traffic.
 */
void HAL_ETH_TxFreeCallback(uint32_t *buff)
{
    /* The buff parameter is actually the pbuf pointer we stored in
     * TxConfig.pData */
    struct pbuf *p = (struct pbuf *)buff;

    if (p != NULL)
    {
        /* Free the pbuf - this decrements the reference count.
         * The pbuf was ref'd in low_level_output() before transmission. */
        pbuf_free(p);
    }
}

void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth_param)
{
    uint32_t error = HAL_ETH_GetDMAError(heth_param);

    if (error & ETH_DMACSR_RBU)
    {
        ETH_DEBUG("RBU Error - restarting RX DMA", 0);
        /* Restart RX DMA by writing tail pointer */
        __DMB();
        WRITE_REG(heth_param->Instance->DMACRDTPR,
                  (uint32_t)(heth_param->Init.RxDesc + (ETH_RX_DESC_CNT - 1U)));
    }

    if (error & ETH_DMACSR_TBU)
    {
        ETH_DEBUG("TBU Error - restarting TX DMA", 0);
        __DMB();
        WRITE_REG(heth_param->Instance->DMACTDTPR,
                  (uint32_t)(heth_param->Init.TxDesc + (ETH_TX_DESC_CNT - 1U)));
    }
}

/**
 * @brief  Check if PHY link state indicates link is truly UP
 */
static inline int is_phy_link_up(int32_t state)
{
    return (state >= LAN8742_STATUS_100MBITS_FULLDUPLEX &&
            state <= LAN8742_STATUS_10MBITS_HALFDUPLEX);
}

#include "lwip/tcpip.h"

struct link_update_msg
{
    struct netif *netif;
    int32_t       phy_state;
};

