sa3mv3g/jerry/application/dependencies/lwip/port/stm32h5/ethernetif.c
static void ethernetif_update_link_state(void *ctx)
{
    struct link_update_msg *msg          = (struct link_update_msg *)ctx;
    struct netif           *netif        = msg->netif;
    int32_t                 PHYLinkState = msg->phy_state;

    /* Link was up, now it's down */
    if (netif_is_link_up(netif) && !is_phy_link_up(PHYLinkState))
    {
        ETH_DEBUG("Link DOWN", 0);
        HAL_ETH_Stop_IT(&heth);
        netif_set_down(netif);
        netif_set_link_down(netif);
    }
    /* Link was down, now it's up */
    else if (!netif_is_link_up(netif) && is_phy_link_up(PHYLinkState))
    {
        ETH_MACConfigTypeDef MACConf = {0};
        uint32_t duplex = ETH_FULLDUPLEX_MODE, speed = ETH_SPEED_100M;

        ETH_DEBUG("Link UP", 0);

        switch (PHYLinkState)
        {
            case LAN8742_STATUS_100MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed  = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_100MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed  = ETH_SPEED_100M;
                break;
            case LAN8742_STATUS_10MBITS_FULLDUPLEX:
                duplex = ETH_FULLDUPLEX_MODE;
                speed  = ETH_SPEED_10M;
                break;
            case LAN8742_STATUS_10MBITS_HALFDUPLEX:
                duplex = ETH_HALFDUPLEX_MODE;
                speed  = ETH_SPEED_10M;
                break;
            default:
                break;
        }
        HAL_ETH_GetMACConfig(&heth, &MACConf);
        MACConf.DuplexMode = duplex;
        MACConf.Speed      = speed;
        HAL_ETH_SetMACConfig(&heth, &MACConf);

        /* Reset buffer tracking before starting ETH */
        RxBuffAssigned   = 0;
        CurrentRxBuffIdx = 0;

        /* Memory barriers before starting DMA */
        __DSB();
        __ISB();

        /* Start ETH - let HAL handle descriptor initialization */
        if (HAL_ETH_Start_IT(&heth) == HAL_OK)
        {
            netif_set_up(netif);
            netif_set_link_up(netif);
            ETH_DEBUG("ETH started", 0);
        }
        else
        {
            ETH_DEBUG("HAL_ETH_Start_IT FAILED!", 0);
        }
    }

    /* Free the allocated message */
    mem_free(msg);
}

void ethernetif_check_link(struct netif *netif)
{
    int32_t PHYLinkState = LAN8742_GetLinkState(&LAN8742);

    uint8_t is_up  = netif_is_link_up(netif) ? 1 : 0;
    uint8_t phy_up = is_phy_link_up(PHYLinkState) ? 1 : 0;

    if (is_up != phy_up)
    {
        /* Post to tcpip_thread to avoid data races on LwIP structures and ETH
         * HAL */
        struct link_update_msg *msg = (struct link_update_msg *)mem_malloc(
            sizeof(struct link_update_msg));
        if (msg != NULL)
        {
            msg->netif     = netif;
            msg->phy_state = PHYLinkState;
            if (tcpip_callback(ethernetif_update_link_state, msg) != ERR_OK)
            {
                mem_free(msg);
            }
        }
    }
}

void ethernetif_poll(struct netif *netif) { ethernetif_input(netif); }

void ethernet_link_thread(void *argument)
{
    struct netif *netif = (struct netif *)argument;

    for (;;)
    {
        ethernetif_check_link(netif);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
}
